tiborsimon/embedded-tdd-headers/pic/pic18/pic18f47k40_tdd.h
#define SLRD1                         1091
#define SLRD2                         1092
#define SLRD3                         1093
#define SLRD4                         1094
#define SLRD5                         1095
#define SLRD6                         1096
#define SLRD7                         1097
#define ODCOND                        1098
#define ODCD0                         1099
#define ODCD1                         1100
#define ODCD2                         1101
#define ODCD3                         1102
#define ODCD4                         1103
#define ODCD5                         1104
#define ODCD6                         1105
#define ODCD7                         1106
#define WPUD                          1107
#define WPUD0                         1108
#define WPUD1                         1109
#define WPUD2                         1110
#define WPUD3                         1111
#define WPUD4                         1112
#define WPUD5                         1113
#define WPUD6                         1114
#define WPUD7                         1115
#define ANSELD                        1116
#define ANSELD0                       1117
#define ANSELD1                       1118
#define ANSELD2                       1119
#define ANSELD3                       1120
#define ANSELD4                       1121
#define ANSELD5                       1122
#define ANSELD6                       1123
#define ANSELD7                       1124
#define IOCEF                         1125
#define IOCEF3                        1126
#define IOCEN                         1127
#define IOCEN3                        1128
#define IOCEP                         1129
#define IOCEP3                        1130
#define INLVLE                        1131
#define INLVLE0                       1132
#define INLVLE1                       1133
#define INLVLE2                       1134
#define INLVLE3                       1135
#define SLRCONE                       1136
#define SLRE0                         1137
#define SLRE1                         1138
#define SLRE2                         1139
#define ODCONE                        1140
#define ODCE0                         1141
#define ODCE1                         1142
#define ODCE2                         1143
#define WPUE                          1144
#define WPUE0                         1145
#define WPUE1                         1146
#define WPUE2                         1147
#define WPUE3                         1148
#define ANSELE                        1149
#define ANSELE0                       1150
#define ANSELE1                       1151
#define ANSELE2                       1152
#define HLVDCON0                      1153
#define INTL                          1154
#define HLVDINTL                      1155
#define INTH                          1156
#define HLVDINTH                      1157
#define RDY                           1158
#define HLVDRDY                       1159
#define HLVDCON0_OUT                  1160
#define HLVDOUT                       1161
#define HLVDEN                        1162
#define HLVDCON0_EN                   1163
#define HLVDCON1                      1164
#define HLVDSEL0                      1165
#define SEL                           1166
#define SEL0                          1167
#define HLVDSEL1                      1168
#define SEL1                          1169
#define HLVDSEL2                      1170
#define SEL2                          1171
#define HLVDSEL3                      1172
#define SEL3                          1173
#define FVRCON                        1174
#define ADFVR0                        1175
#define ADFVR                         1176
#define ADFVR1                        1177
#define CDAFVR                        1178
#define CDAFVR0                       1179
#define CDAFVR1                       1180
#define TSRNG                         1181
#define TSEN                          1182
#define FVRRDY                        1183
#define FVREN                         1184
#define ZCDCON                        1185
#define ZCDINTN                       1186
#define ZCDINTP                       1187
#define ZCDPOL                        1188
#define ZCDOUT                        1189
#define ZCDSEN                        1190
#define DAC1CON0                      1191
#define NSS                           1192
#define DAC1NSS                       1193
#define DAC1PSS0                      1194
#define PSS                           1195
#define PSS0                          1196
#define PSS1                          1197
#define DAC1PSS1                      1198
#define OE2                           1199
#define DAC1OE2                       1200
#define OE1                           1201
#define DAC1OE1                       1202
#define DAC1CON0_EN                   1203
#define DAC1EN                        1204
#define DAC1CON1                      1205
#define DAC1R                         1206
#define DAC1R0                        1207
#define DAC1R1                        1208
#define DAC1R2                        1209
#define DAC1R3                        1210
#define DAC1R4                        1211
#define CM2CON0                       1212
#define CM2CON0_SYNC                  1213
#define C2SYNC                        1214
#define C2HYS                         1215
#define CM2CON0_HYS                   1216
#define C2POL                         1217
#define CM2CON0_POL                   1218
#define C2OUT                         1219
#define CM2CON0_OUT                   1220
#define CM2CON0_EN                    1221
#define C2EN                          1222
#define CM2CON1                       1223
#define C2INTN                        1224
#define CM2CON1_INTN                  1225
#define CM2CON1_INTP                  1226
#define C2INTP                        1227
#define CM2NCH                        1228
#define C2NCH0                        1229
#define CM2NCH_NCH0                   1230
#define CM2NCH_NCH                    1231
#define C2NCH1                        1232
#define CM2NCH_NCH1                   1233
#define C2NCH2                        1234
#define CM2NCH_NCH2                   1235
#define CM2PCH                        1236
#define CM2PCH_PCH                    1237
#define C2PCH0                        1238
#define CM2PCH_PCH0                   1239
#define C2PCH1                        1240
#define CM2PCH_PCH1                   1241
#define C2PCH2                        1242
#define CM2PCH_PCH2                   1243
#define CM1CON0                       1244
#define CM1CON0_SYNC                  1245
#define C1SYNC                        1246
#define CM1CON0_HYS                   1247
#define C1HYS                         1248
#define CM1CON0_POL                   1249
#define C1POL                         1250
#define C1OUT                         1251
#define CM1CON0_OUT                   1252
#define CM1CON0_EN                    1253
#define C1EN                          1254
#define CM1CON1                       1255
#define C1INTN                        1256
#define CM1CON1_INTN                  1257
#define CM1CON1_INTP                  1258
#define C1INTP                        1259
#define CM1NCH                        1260
#define C1NCH0                        1261
#define CM1NCH_NCH0                   1262
#define CM1NCH_NCH                    1263
#define C1NCH1                        1264
#define CM1NCH_NCH1                   1265
#define C1NCH2                        1266
#define CM1NCH_NCH2                   1267
#define CM1PCH                        1268
#define CM1PCH_PCH0                   1269
#define C1PCH0                        1270
#define CM1PCH_PCH                    1271
#define CM1PCH_PCH1                   1272
#define C1PCH1                        1273
#define CM1PCH_PCH2                   1274
#define C1PCH2                        1275
#define CMOUT                         1276
#define MC1OUT                        1277
#define MC2OUT                        1278
#define CLKRCON                       1279
#define CLKRDIV0                      1280
#define DIV                           1281
#define DIV0                          1282
#define CLKRDIV1                      1283
#define DIV1                          1284
#define DIV2                          1285
#define CLKRDIV2                      1286
#define CLKRCON_DC                    1287
#define CLKRCON_DC0                   1288
#define CLKRDC0                       1289
#define CLKRCON_DC1                   1290
#define CLKRDC1                       1291
#define CLKRCON_EN                    1292
#define CLKREN                        1293
#define CLKRCLK                       1294
#define CLKRCLK0                      1295
#define CLK                           1296
#define CLK0                          1297
#define CLKRCLK1                      1298
#define CLK1                          1299
#define CLKRCLK2                      1300
#define CLK2                          1301
#define CWG1CLKCON                    1302
#define CWG1CLKCON_CS                 1303
#define CWG1CS                        1304
#define CWG1ISM                       1305
#define CWG1ISM0                      1306
#define IS                            1307
#define CWG1ISM1                      1308
#define CWG1ISM2                      1309
#define CWG1ISM3                      1310
#define CWG1DBR0                      1311
#define CWG1DBR                       1312
#define DBR                           1313
#define DBR0                          1314
#define CWG1DBR1                      1315
#define DBR1                          1316
#define CWG1DBR2                      1317
#define DBR2                          1318
#define CWG1DBR3                      1319
#define DBR3                          1320
#define CWG1DBR4                      1321
#define DBR4                          1322
#define CWG1DBR5                      1323
#define DBR5                          1324
#define CWG1DBF                       1325
#define CWG1DBF0                      1326
#define DBF                           1327
#define DBF0                          1328
#define CWG1DBF1                      1329
#define DBF1                          1330
#define CWG1DBF2                      1331
#define DBF2                          1332
#define CWG1DBF3                      1333
#define DBF3                          1334
#define CWG1DBF4                      1335
#define DBF4                          1336
#define DBF5                          1337
#define CWG1DBF5                      1338
#define CWG1CON0                      1339
#define CWG1MODE0                     1340
#define CWG1CON0_MODE                 1341
#define CWG1CON0_MODE0                1342
#define CWG1MODE                      1343
#define CWG1MODE1                     1344
#define CWG1CON0_MODE1                1345
#define CWG1MODE2                     1346
#define CWG1CON0_MODE2                1347
#define LD                            1348
#define CWG1LD                        1349
#define CWG1EN                        1350
#define G1EN                          1351
#define CWG1CON0_EN                   1352
#define CWG1CON1                      1353
#define CWG1POLA                      1354
#define POLA                          1355
#define CWG1POLB                      1356
#define POLB                          1357
#define CWG1POLC                      1358
#define POLC                          1359
#define CWG1POLD                      1360
#define POLD                          1361
#define IN                            1362
#define CWG1IN                        1363
#define CWG1AS0                       1364
#define CWG1LSAC                      1365
#define LSAC                          1366
#define LSAC0                         1367
#define CWG1LSAC0                     1368
#define LSAC1                         1369
#define CWG1LSAC1                     1370
#define LSBD0                         1371
#define CWG1LSBD0                     1372
#define LSBD                          1373
#define CWG1LSBD                      1374
#define LSBD1                         1375
#define CWG1LSBD1                     1376
#define CWG1REN                       1377
#define REN                           1378
#define CWG1SHUTDOWN                  1379
#define SHUTDOWN                      1380
#define CWG1AS1                       1381
#define AS0E                          1382
#define AS1E                          1383
#define AS2E                          1384
#define AS3E                          1385
#define AS4E                          1386
#define AS5E                          1387
#define CWG1STR                       1388
#define CWG1STRA                      1389
#define STRA                          1390
#define STRB                          1391
#define CWG1STRB                      1392
#define CWG1STRC                      1393
#define STRC                          1394
#define CWG1STRD                      1395
#define STRD                          1396
#define OVRA                          1397
#define CWG1OVRA                      1398
#define CWG1OVRB                      1399
#define OVRB                          1400
#define OVRC                          1401
#define CWG1OVRC                      1402
#define OVRD                          1403
#define CWG1OVRD                      1404
#define SCANLADRL                     1405
#define SCANLADRL_LADR                1406
#define SCANLADRL_SCANLADR            1407
#define LADR0                         1408
#define SCANLADR0                     1409
#define SCANLADR1                     1410
#define LADR1                         1411
#define LADR2                         1412
#define SCANLADR2                     1413
#define LADR3                         1414
#define SCANLADR3                     1415
#define LADR4                         1416
#define SCANLADR4                     1417
#define LADR5                         1418
#define SCANLADR5                     1419
#define SCANLADR6                     1420
#define LADR6                         1421
#define LADR7                         1422
#define SCANLADR7                     1423
#define SCANLADRH                     1424
#define LADR8                         1425
#define SCANLADRH_SCANLADR            1426
#define SCANLADR8                     1427
#define SCANLADRH_LADR                1428
#define LADR9                         1429
#define SCANLADR9                     1430
#define LADR10                        1431
#define SCANLADR10                    1432
#define SCANLADR11                    1433
#define LADR11                        1434
#define LADR12                        1435
#define SCANLADR12                    1436
#define LADR13                        1437
#define SCANLADR13                    1438
#define LADR14                        1439
#define SCANLADR14                    1440
#define LADR15                        1441
#define SCANLADR15                    1442
#define SCANLADRU                     1443
#define LADR16                        1444
#define SCANLADR16                    1445
#define SCANLADRU_SCANLADR            1446
#define SCANLADRU_LADR                1447
#define SCANLADR17                    1448
#define LADR17                        1449
#define LADR18                        1450
#define SCANLADR18                    1451
#define LADR19                        1452
#define SCANLADR19                    1453
#define SCANLADR20                    1454
#define LADR20                        1455
#define SCANLADR21                    1456
#define LADR21                        1457
#define SCANHADRL                     1458
#define SCANHADR0                     1459
#define HADR0                         1460
#define SCANHADRL_HADR                1461
#define SCANHADRL_SCANHADR            1462
#define SCANHADR1                     1463
#define HADR1                         1464
#define SCANHADR2                     1465
#define HADR2                         1466
#define SCANHADR3                     1467
#define HADR3                         1468
#define SCANHADR4                     1469
#define HADR4                         1470
#define SCANHADR5                     1471
#define HADR5                         1472
#define SCANHADR6                     1473
#define HADR6                         1474
#define SCANHADR7                     1475
#define HADR7                         1476
#define SCANHADRH                     1477
#define HADR8                         1478
#define SCANHADRH_SCANHADR            1479
#define SCANHADR8                     1480
#define SCANHADRH_HADR                1481
#define HADR9                         1482
#define SCANHADR9                     1483
#define HADR10                        1484
#define SCANHADR10                    1485
#define SCANHADR11                    1486
#define HADR11                        1487
#define HADR12                        1488
#define SCANHADR12                    1489
#define HADR13                        1490
#define SCANHADR13                    1491
#define HADR14                        1492
#define SCANHADR14                    1493
#define HADR15                        1494
#define SCANHADR15                    1495
#define SCANHADRU                     1496
#define SCANHADRU_SCANHADR            1497
#define SCANHADRU_HADR                1498
#define HADR16                        1499
#define SCANHADR16                    1500
#define SCANHADR17                    1501
#define HADR17                        1502
#define HADR18                        1503
#define SCANHADR18                    1504
#define HADR19                        1505
#define SCANHADR19                    1506
#define HADR20                        1507
#define SCANHADR20                    1508
#define SCANHADR21                    1509
#define HADR21                        1510
#define SCANCON0                      1511
#define SCANMODE0                     1512
#define SCANCON0_MODE                 1513
#define SCANCON0_MODE0                1514
#define SCANMODE                      1515
#define SCANMODE1                     1516
#define SCANCON0_MODE1                1517
#define INTM                          1518
#define SCANINTM                      1519
#define DABORT                        1520
#define SCANINVALID                   1521
#define INVALID                       1522
#define SCANCON0_BUSY                 1523
#define SCANBUSY                      1524
#define SCANCON0_GO                   1525
#define SCANGO                        1526
#define SCANCON0_EN                   1527
#define SCANEN                        1528
#define SCANTRIG                      1529
#define TSEL0                         1530
#define TSEL                          1531
#define SCANTSEL0                     1532
#define SCANTSEL                      1533
#define TSEL1                         1534
#define SCANTSEL1                     1535
#define TSEL2                         1536
#define SCANTSEL2                     1537
#define TSEL3                         1538
#define SCANTSEL3                     1539
#define MDCON0                        1540
#define MDBIT                         1541
#define BIT                           1542
#define OPOL                          1543
#define MDOPOL                        1544
#define MDOUT                         1545
#define MDCON0_OUT                    1546
#define MDEN                          1547
#define MDCON0_EN                     1548
#define MDCON1                        1549
#define MDCLSYNC                      1550
#define CLSYNC                        1551
#define MDCLPOL                       1552
#define CLPOL                         1553
#define CHSYNC                        1554
#define MDCHSYNC                      1555
#define MDCHPOL                       1556
#define CHPOL                         1557
#define MDSRC                         1558
#define SRCS0                         1559
#define MDSRCS                        1560
#define SRCS                          1561
#define MDSRCS0                       1562
#define SRCS1                         1563
#define MDSRCS1                       1564
#define SRCS2                         1565
#define MDSRCS2                       1566
#define SRCS3                         1567
#define MDSRCS3                       1568
#define MDCARL                        1569
#define CLS0                          1570
#define MDCLS                         1571
#define MDCLS0                        1572
#define CLS                           1573
#define CLS1                          1574
#define MDCLS1                        1575
#define CLS2                          1576
#define MDCLS2                        1577
#define MDCARH                        1578
#define CHS0                          1579
#define CHS                           1580
#define MDCHS                         1581
#define MDCHS0                        1582
#define CHS1                          1583
#define MDCHS1                        1584
#define CHS2                          1585
#define MDCHS2                        1586
#define ADACT0                        1587
#define ADACT                         1588
#define ADACT1                        1589
#define ADACT2                        1590
#define ADACT3                        1591
#define ADACT4                        1592
#define ADCLK                         1593
#define ADCS0                         1594
#define ADCLK_ADCS                    1595
#define ADCS1                         1596
#define ADCS2                         1597
#define ADCS3                         1598
#define ADCS4                         1599
#define ADCS5                         1600
#define ADREF                         1601
#define ADPREF                        1602
#define ADPREF0                       1603
#define ADPREF1                       1604
#define ADNREF                        1605
#define ADCON1                        1606
#define ADDSEN                        1607
#define NVCFG0                        1608
#define NVCFG1                        1609
#define PVCFG0                        1610
#define CHSN3                         1611
#define PVCFG1                        1612
#define VCFG11                        1613
#define ADGPOL                        1614
#define ADIPEN                        1615
#define ADPPOL                        1616
#define ADCON2                        1617
#define ADMD                          1618
#define ADMD0                         1619
#define ADMD1                         1620
#define ADMD2                         1621
#define ADACLR                        1622
#define ADCRS                         1623
#define ADCRS0                        1624
#define ADCRS1                        1625
#define ADCRS2                        1626
#define ADPSIS                        1627
#define ADCON3                        1628
#define ADTMD                         1629
#define ADTMD0                        1630
#define ADTMD1                        1631
#define ADTMD2                        1632
#define ADSOI                         1633
#define ADCALC                        1634
#define ADCALC0                       1635
#define ADCALC1                       1636
#define ADCALC2                       1637
#define ADACQ                         1638
#define ADACQ0                        1639
#define ADACQ1                        1640
#define ADACQ2                        1641
#define ADACQ3                        1642
#define ADACQ4                        1643
#define ADACQ5                        1644
#define ADACQ6                        1645
#define ADACQ7                        1646
#define ADCAP                         1647
#define ADCAP0                        1648
