tiborsimon/embedded-tdd-headers/pic/pic18/pic18f47k40_tdd.h
#define CCP2E                         2207
#define PA2E                          2208
#define RE7                           2209
#define SSP1BUF                       2210
#define SSP1BUF_SSPBUF                2211
#define SSP1ADD                       2212
#define SSP1ADD_SSPADD                2213
#define SSP1ADD_MSK0                  2214
#define MSK01                         2215
#define SSP1ADD_MSK1                  2216
#define MSK11                         2217
#define SSP1ADD_MSK2                  2218
#define MSK21                         2219
#define MSK31                         2220
#define SSP1ADD_MSK3                  2221
#define SSP1ADD_MSK4                  2222
#define MSK41                         2223
#define MSK51                         2224
#define SSP1ADD_MSK5                  2225
#define SSP1ADD_MSK6                  2226
#define MSK61                         2227
#define MSK71                         2228
#define SSP1ADD_MSK7                  2229
#define SSP1MSK                       2230
#define SSP1MSK_MSK0                  2231
#define SSP1MSK_SSPMSK                2232
#define SSP1MSK_MSK1                  2233
#define SSP1MSK_MSK2                  2234
#define SSP1MSK_MSK3                  2235
#define SSP1MSK_MSK4                  2236
#define SSP1MSK_MSK5                  2237
#define SSP1MSK_MSK6                  2238
#define SSP1MSK_MSK7                  2239
#define SSP1STAT                      2240
#define BF1                           2241
#define SSP1STAT_BF                   2242
#define UA1                           2243
#define SSP1STAT_UA                   2244
#define SSP1STAT_R_NOT_W              2245
#define RW1                           2246
#define SSP1STAT_nW                   2247
#define RW                            2248
#define SSP1STAT_READ_WRITE           2249
#define SSP1STAT_nWRITE               2250
#define SSP1STAT_I2C_READ             2251
#define SSP1STAT_R_W                  2252
#define R                             2253
#define SSP1STAT_NOT_WRITE            2254
#define SSP1STAT_R_nW                 2255
#define SSP1STAT_S                    2256
#define START                         2257
#define START1                        2258
#define SSP1STAT_I2C_START            2259
#define STOP                          2260
#define SSP1STAT_P                    2261
#define STOP1                         2262
#define SSP1STAT_I2C_STOP             2263
#define SSP1STAT_D_NOT_A              2264
#define SSP1STAT_D_A                  2265
#define SSP1STAT_D_nA                 2266
#define SSP1STAT_NOT_ADDRESS          2267
#define SSP1STAT_DATA_ADDRESS         2268
#define SSP1STAT_nA                   2269
#define D                             2270
#define DA1                           2271
#define DA                            2272
#define SSP1STAT_nADDRESS             2273
#define SSP1STAT_I2C_DAT              2274
#define SSP1STAT_CKE                  2275
#define CKE1                          2276
#define SSP1STAT_SMP                  2277
#define SMP1                          2278
#define SSP1CON1                      2279
#define SSP1CON1_SSPM0                2280
#define SSPM01                        2281
#define SSP1CON1_SSPM                 2282
#define SSP1CON1_SSPM1                2283
#define SSPM11                        2284
#define SSP1CON1_SSPM2                2285
#define SSPM21                        2286
#define SSPM31                        2287
#define SSP1CON1_SSPM3                2288
#define SSP1CON1_CKP                  2289
#define CKP1                          2290
#define SSPEN1                        2291
#define SSP1CON1_SSPEN                2292
#define SSPOV1                        2293
#define SSP1CON1_SSPOV                2294
#define WCOL1                         2295
#define SSP1CON1_WCOL                 2296
#define SSP1CON2                      2297
#define SEN1                          2298
#define SSP1CON2_SEN                  2299
#define ADMSK11                       2300
#define SSP1CON2_RSEN                 2301
#define RSEN1                         2302
#define SSP1CON2_ADMSK1               2303
#define SSP1CON2_ADMSK                2304
#define SSP1CON2_PEN                  2305
#define ADMSK21                       2306
#define PEN1                          2307
#define SSP1CON2_ADMSK2               2308
#define ADMSK31                       2309
#define RCEN1                         2310
#define SSP1CON2_RCEN                 2311
#define SSP1CON2_ADMSK3               2312
#define SSP1CON2_ACKEN                2313
#define ACKEN1                        2314
#define ADMSK41                       2315
#define SSP1CON2_ADMSK4               2316
#define ACKDT1                        2317
#define ADMSK51                       2318
#define SSP1CON2_ACKDT                2319
#define SSP1CON2_ADMSK5               2320
#define SSP1CON2_ACKSTAT              2321
#define ACKSTAT1                      2322
#define GCEN1                         2323
#define SSP1CON2_GCEN                 2324
#define SSP1CON3                      2325
#define SSP1CON3_DHEN                 2326
#define SSP1CON3_AHEN                 2327
#define SSP1CON3_SBCDE                2328
#define SSP1CON3_SDAHT                2329
#define SSP1CON3_BOEN                 2330
#define SSP1CON3_SCIE                 2331
#define SSP1CON3_PCIE                 2332
#define SSP1CON3_ACKTIM               2333
#define RC1REG                        2334
#define TX1REG                        2335
#define SP1BRGL                       2336
#define SP1BRGH                       2337
#define RC1STA                        2338
#define RC1STA_RX9D                   2339
#define RCD8                          2340
#define RC1STA_OERR                   2341
#define RC1STA_FERR                   2342
#define RC1STA_ADDEN                  2343
#define RC1STA_CREN                   2344
#define RC1STA_SREN                   2345
#define RC1STA_RX9                    2346
#define RC8_9                         2347
#define RC9                           2348
#define RC1STA_SPEN                   2349
#define TX1STA                        2350
#define TXD8                          2351
#define TX1STA_TX9D                   2352
#define TX1STA_TRMT                   2353
#define TX1STA_BRGH                   2354
#define TX1STA_SENDB                  2355
#define TX1STA_SYNC                   2356
#define TX1STA_TXEN                   2357
#define TX1STA_TX9                    2358
#define TX8_9                         2359
#define TX1STA_CSRC                   2360
#define BAUD1CON                      2361
#define ABDEN1                        2362
#define BAUD1CON_ABDEN                2363
#define WUE1                          2364
#define BAUD1CON_WUE                  2365
#define BRG161                        2366
#define BAUD1CON_BRG16                2367
#define SCKP1                         2368
#define CKTXP                         2369
#define TXCKP                         2370
#define BAUD1CON_SCKP                 2371
#define TXCKP1                        2372
#define BAUD1CON_RCIDL                2373
#define RCMT1                         2374
#define RCIDL1                        2375
#define RCMT                          2376
#define BAUD1CON_ABDOVF               2377
#define ABDOVF1                       2378
#define PWM4DCL                       2379
#define PWM4DCL_PWMPW0                2380
#define PWM4DCL_DC                    2381
#define PWM4DC0                       2382
#define PWM4DCL_DC0                   2383
#define PWM4DCL_PWMPW1                2384
#define PWM4DC1                       2385
#define PWM4DCL_DC1                   2386
#define PWM4DCH                       2387
#define PWM4DCH_PWMPW2                2388
#define PWM4DCH_DC                    2389
#define PWM4DC2                       2390
#define PWM4DCH_DC2                   2391
#define PWM4DCH_PWMPW3                2392
#define PWM4DC3                       2393
#define PWM4DCH_DC3                   2394
#define PWM4DCH_PWMPW4                2395
#define PWM4DC4                       2396
#define PWM4DCH_DC4                   2397
#define PWM4DCH_PWMPW5                2398
#define PWM4DC5                       2399
#define PWM4DCH_DC5                   2400
#define PWM4DCH_PWMPW6                2401
#define PWM4DC6                       2402
#define PWM4DCH_DC6                   2403
#define PWM4DCH_PWMPW7                2404
#define PWM4DC7                       2405
#define PWM4DCH_DC7                   2406
#define PWM4DCH_PWMPW8                2407
#define PWM4DC8                       2408
#define PWM4DCH_DC8                   2409
#define PWM4DCH_PWMPW9                2410
#define PWM4DC9                       2411
#define PWM4DCH_DC9                   2412
#define PWM4CON                       2413
#define PWM4POL                       2414
#define PWM4CON_POL                   2415
#define PWM4CON_OUT                   2416
#define PWM4OUT                       2417
#define PWM4EN                        2418
#define PWM4CON_EN                    2419
#define PWM3DCL                       2420
#define PWM3DC0                       2421
#define PWM3DCL_PWMPW0                2422
#define PWM3DCL_DC0                   2423
#define PWM3DCL_DC                    2424
#define PWM3DC1                       2425
#define PWM3DCL_PWMPW1                2426
#define PWM3DCL_DC1                   2427
#define PWM3DCH                       2428
#define PWM3DC2                       2429
#define PWM3DCH_DC2                   2430
#define PWM3DCH_DC                    2431
#define PWM3DCH_PWMPW2                2432
#define PWM3DC3                       2433
#define PWM3DCH_DC3                   2434
#define PWM3DCH_PWMPW3                2435
#define PWM3DC4                       2436
#define PWM3DCH_DC4                   2437
#define PWM3DCH_PWMPW4                2438
#define PWM3DC5                       2439
#define PWM3DCH_DC5                   2440
#define PWM3DCH_PWMPW5                2441
#define PWM3DC6                       2442
#define PWM3DCH_DC6                   2443
#define PWM3DCH_PWMPW6                2444
#define PWM3DC7                       2445
#define PWM3DCH_DC7                   2446
#define PWM3DCH_PWMPW7                2447
#define PWM3DC8                       2448
#define PWM3DCH_DC8                   2449
#define PWM3DCH_PWMPW8                2450
#define PWM3DC9                       2451
#define PWM3DCH_DC9                   2452
#define PWM3DCH_PWMPW9                2453
#define PWM3CON                       2454
#define PWM3CON_POL                   2455
#define PWM3POL                       2456
#define PWM3CON_OUT                   2457
#define PWM3OUT                       2458
#define PWM3EN                        2459
#define PWM3CON_EN                    2460
#define CCPR2L                        2461
#define CCPR2L_RL                     2462
#define CCPR2H                        2463
#define CCPR2H_RH                     2464
#define CCP2CON                       2465
#define CCP2MODE                      2466
#define CCP2MODE0                     2467
#define CCP2CON_MODE0                 2468
#define CCP2CON_MODE                  2469
#define CCP2MODE1                     2470
#define CCP2CON_MODE1                 2471
#define CCP2MODE2                     2472
#define CCP2CON_MODE2                 2473
#define CCP2MODE3                     2474
#define CCP2CON_MODE3                 2475
#define CCP2FMT                       2476
#define CCP2CON_FMT                   2477
#define CCP2OUT                       2478
#define CCP2CON_OUT                   2479
#define CCP2EN                        2480
#define CCP2CON_EN                    2481
#define CCP2CAP                       2482
#define CCP2CAP_CTS                   2483
#define CCP2CAP_CTS0                  2484
#define CCP2CTS                       2485
#define CCP2CTS0                      2486
#define CCP2CAP_CTS1                  2487
#define CCP2CTS1                      2488
#define CCPR1L                        2489
#define CCPR1L_RL                     2490
#define CCPR1H                        2491
#define CCPR1H_RH                     2492
#define CCP1CON                       2493
#define CCP1MODE0                     2494
#define CCP1CON_MODE0                 2495
#define CCP1CON_MODE                  2496
#define CCP1MODE                      2497
#define CCP1MODE1                     2498
#define CCP1CON_MODE1                 2499
#define CCP1MODE2                     2500
#define CCP1CON_MODE2                 2501
#define CCP1MODE3                     2502
#define CCP1CON_MODE3                 2503
#define CCP1FMT                       2504
#define CCP1CON_FMT                   2505
#define CCP1CON_OUT                   2506
#define CCP1OUT                       2507
#define CCP1EN                        2508
#define CCP1CON_EN                    2509
#define P1M1                          2510
#define CCP1CAP                       2511
#define CCP1CTS0                      2512
#define CCP1CAP_CTS                   2513
#define CCP1CAP_CTS0                  2514
#define CCP1CTS                       2515
#define CCP1CTS1                      2516
#define CCP1CAP_CTS1                  2517
#define CCPTMRS                       2518
#define C1TSEL0                       2519
#define C1TSEL                        2520
#define C1TSEL1                       2521
#define C2TSEL0                       2522
#define C2TSEL                        2523
#define C2TSEL1                       2524
#define P3TSEL                        2525
#define P3TSEL0                       2526
#define P3TSEL1                       2527
#define P4TSEL0                       2528
#define P4TSEL                        2529
#define P4TSEL1                       2530
#define T6TMR                         2531
#define TMR6                          2532
#define T6PR                          2533
#define PR6                           2534
#define T6CON                         2535
#define T6CON_OUTPS0                  2536
#define T6OUTPS                       2537
#define T6CON_OUTPS                   2538
#define T6OUTPS0                      2539
#define T6CON_OUTPS1                  2540
#define T6OUTPS1                      2541
#define T6CON_OUTPS2                  2542
#define T6OUTPS2                      2543
#define T6CON_OUTPS3                  2544
#define T6OUTPS3                      2545
#define T6CON_CKPS0                   2546
#define T6CKPS                        2547
#define T6CKPS0                       2548
#define T6CON_CKPS                    2549
#define T6CON_CKPS1                   2550
#define T6CKPS1                       2551
#define T6CON_CKPS2                   2552
#define T6CKPS2                       2553
#define TMR6ON                        2554
#define T6ON                          2555
#define T6CON_ON                      2556
#define T6HLT                         2557
#define T6HLT_MODE0                   2558
#define T6HLT_MODE                    2559
#define T6MODE0                       2560
#define T6MODE                        2561
#define T6HLT_MODE1                   2562
#define T6MODE1                       2563
#define T6MODE2                       2564
#define T6HLT_MODE2                   2565
#define T6HLT_MODE3                   2566
#define T6MODE3                       2567
#define T6MODE4                       2568
#define T6HLT_MODE4                   2569
#define T6CKSYNC                      2570
#define T6HLT_CKSYNC                  2571
#define T6CKPOL                       2572
#define T6HLT_CKPOL                   2573
#define T6PSYNC                       2574
#define T6HLT_PSYNC                   2575
#define T6CLKCON                      2576
#define T6CS                          2577
#define T6CS0                         2578
#define T6CS1                         2579
#define T6CS2                         2580
#define T6CS3                         2581
#define T6RST                         2582
#define T6RST_RSEL                    2583
#define T6RST_RSEL0                   2584
#define T6RSEL                        2585
#define T6RSEL0                       2586
#define T6RST_RSEL1                   2587
#define T6RSEL1                       2588
#define T6RSEL2                       2589
#define T6RST_RSEL2                   2590
#define T6RST_RSEL3                   2591
#define T6RSEL3                       2592
#define T4TMR                         2593
#define TMR4                          2594
#define T4PR                          2595
#define PR4                           2596
#define T4CON                         2597
#define T4OUTPS0                      2598
#define T4CON_OUTPS                   2599
#define T4OUTPS                       2600
#define T4CON_OUTPS0                  2601
#define T4OUTPS1                      2602
#define T4CON_OUTPS1                  2603
#define T4CON_OUTPS2                  2604
#define T4OUTPS2                      2605
#define T4OUTPS3                      2606
#define T4CON_OUTPS3                  2607
#define T4CON_CKPS0                   2608
#define T4CKPS0                       2609
#define T4CON_CKPS                    2610
#define T4CKPS                        2611
#define T4CKPS1                       2612
#define T4CON_CKPS1                   2613
#define T4CKPS2                       2614
#define T4CON_CKPS2                   2615
#define T4ON                          2616
#define T4CON_ON                      2617
#define TMR4ON                        2618
#define T4HLT                         2619
#define T4MODE                        2620
#define T4HLT_MODE                    2621
#define T4HLT_MODE0                   2622
#define T4MODE0                       2623
#define T4HLT_MODE1                   2624
#define T4MODE1                       2625
#define T4HLT_MODE2                   2626
#define T4MODE2                       2627
#define T4HLT_MODE3                   2628
#define T4MODE3                       2629
#define T4HLT_MODE4                   2630
#define T4MODE4                       2631
#define T4HLT_CKSYNC                  2632
#define T4CKSYNC                      2633
#define T4HLT_CKPOL                   2634
#define T4CKPOL                       2635
#define T4PSYNC                       2636
#define T4HLT_PSYNC                   2637
#define T4CLKCON                      2638
#define T4CS0                         2639
#define T4CS                          2640
#define T4CS1                         2641
#define T4CS2                         2642
#define T4CS3                         2643
#define T4RST                         2644
#define T4RSEL0                       2645
#define T4RSEL                        2646
#define T4RST_RSEL                    2647
#define T4RST_RSEL0                   2648
#define T4RSEL1                       2649
#define T4RST_RSEL1                   2650
#define T4RSEL2                       2651
#define T4RST_RSEL2                   2652
#define T4RSEL3                       2653
#define T4RST_RSEL3                   2654
#define T2TMR                         2655
#define TMR2                          2656
#define T2PR                          2657
#define PR2                           2658
#define T2CON                         2659
#define T2OUTPS0                      2660
#define T2CON_OUTPS0                  2661
#define T2OUTPS                       2662
#define T2CON_OUTPS                   2663
#define T2OUTPS1                      2664
#define T2CON_OUTPS1                  2665
#define T2OUTPS2                      2666
#define T2CON_OUTPS2                  2667
#define T2OUTPS3                      2668
#define T2CON_OUTPS3                  2669
#define T2CKPS0                       2670
#define T2CON_CKPS                    2671
#define T2CKPS                        2672
#define T2CON_CKPS0                   2673
#define T2CKPS1                       2674
#define T2CON_CKPS1                   2675
#define T2CKPS2                       2676
#define T2CON_CKPS2                   2677
#define T2CON_ON                      2678
#define TMR2ON                        2679
#define T2ON                          2680
#define T2HLT                         2681
#define T2HLT_MODE                    2682
#define T2MODE                        2683
#define T2MODE0                       2684
#define T2HLT_MODE0                   2685
#define T2MODE1                       2686
#define T2HLT_MODE1                   2687
#define T2MODE2                       2688
#define T2HLT_MODE2                   2689
#define T2MODE3                       2690
#define T2HLT_MODE3                   2691
#define T2MODE4                       2692
#define T2HLT_MODE4                   2693
#define T2HLT_CKSYNC                  2694
#define T2CKSYNC                      2695
#define T2HLT_CKPOL                   2696
#define T2CKPOL                       2697
#define T2PSYNC                       2698
#define T2HLT_PSYNC                   2699
#define T2CLKCON                      2700
#define T2CS                          2701
#define T2CS0                         2702
#define T2CS1                         2703
#define T2CS2                         2704
#define T2CS3                         2705
#define T2RST                         2706
#define T2RSEL0                       2707
#define T2RST_RSEL                    2708
#define T2RSEL                        2709
#define T2RST_RSEL0                   2710
#define T2RSEL1                       2711
#define T2RST_RSEL1                   2712
#define T2RST_RSEL2                   2713
#define T2RSEL2                       2714
#define T2RSEL3                       2715
#define T2RST_RSEL3                   2716
#define TMR5L                         2717
#define TMR5L0                        2718
#define TMR5L1                        2719
#define TMR5L2                        2720
#define TMR5L3                        2721
#define TMR5L4                        2722
#define TMR5L5                        2723
#define TMR5L6                        2724
#define TMR5L7                        2725
#define TMR5H0                        2726
#define TMR5H                         2727
#define TMR5H1                        2728
#define TMR5H2                        2729
#define TMR5H3                        2730
#define TMR5H4                        2731
#define TMR5H5                        2732
#define TMR5H6                        2733
#define TMR5H7                        2734
#define T5CON                         2735
#define T5CON_ON                      2736
#define TMR5ON                        2737
#define T5CON_RD16                    2738
#define T5RD16                        2739
#define RD165                         2740
#define nT5SYNC                       2741
#define T5CON_nSYNC                   2742
#define T5CON_NOT_SYNC                2743
#define NOT_T5SYNC                    2744
#define T5CON_CKPS0                   2745
#define T5CON_CKPS                    2746
#define T5CKPS0                       2747
#define T5CON_CKPS1                   2748
#define T5CKPS1                       2749
#define T5GCON                        2750
#define T5GCON_GVAL                   2751
#define T5GVAL                        2752
#define T5GGO_nDONE                   2753
#define T5GCON_GGO_NOT_DONE           2754
#define T5GCON_GGO_nDONE              2755
#define T5GGO_NOT_DONE                2756
#define T5GGO                         2757
#define T5GCON_GSPM                   2758
#define T5GSPM                        2759
#define T5GTM                         2760
#define T5GCON_GTM                    2761
#define T5GPOL                        2762
#define T5GCON_GPOL                   2763
#define T5GCON_GE                     2764
